{
    "nav_about": "[About Us]",
    "nav_products": "[Products]",
    "nav_catalog": "[Catalog]",
    "nav_tech": "[Technology]",
    "nav_contact": "[Contact]",
    "hero_title": "[Provider of Water Treatment Application Membrane Environmental Solutions]",
    "hero_subtitle": "[Innovative Technology · Integrity Service · Sustainable Development]",
    "about_title": "[About Us]",
    "about_p1": "[JHB-Envirotech is dedicated to providing comprehensive water treatment environmental engineering solutions and acting as an agent for professional water treatment equipment, contributing to environmental sustainability. We uphold the philosophy of innovative technology and integrity service, aiming to be your most trustworthy partner.]",
    "about_memstar_title": "[1. Memstar]",
    "about_memstar_p": "[Memstar is a leading global membrane technology company specializing in high-performance PVDF hollow fiber ultrafiltration membranes, widely used in industrial and municipal water treatment. The company has over 220 successful cases worldwide, with a daily processing capacity of over 10 million cubic meters, and holds more than 150 patents. Memstar is headquartered in Singapore with production facilities in China.]",
    "about_thetis_title": "[2. Thetis]",
    "about_thetis_p": "[Thetis technology originated in 1989 and has a development history of nearly 30 years. As a global leader in membrane separation technology, Thetis Environmental has been committed to the development and application of advanced membrane separation technologies. As part of Thetis's global strategy, Perma Filters began operations in the Asia-Pacific region in 2024.]",
    "about_natureworks_title": "[3. Nature Works]",
    "about_natureworks_p": "[Nature Works is a professional brand specializing in high-performance glass filter media. The products are derived from first-generation recyclable flat glass and designed by a Spanish R&D team for water treatment and filtration applications. Its products have passed multiple international certifications, including NSF in the US, Bureau Veritas in France, and Bioexam in Switzerland, and are widely used in swimming pools, industrial, domestic, and high-end water treatment systems.]",
    "products_title": "[Our Products]",
    "prod1_title": "[Ultrafiltration (UF) Membrane - External Pressure]",
    "prod1_subtitle": "[Application Development of UF Membrane Technology]",
    "prod1_p": "[Research on the retention efficiency and modular design of ultrafiltration membranes in industrial and domestic wastewater treatment to improve effluent quality and operational stability.]",
    "prod2_title": "[Ultrafiltration (UF) Membrane - Internal Pressure]",
    "prod2_subtitle": "[Application Development of UF Membrane Technology]",
    "prod2_p": "[Research on the filtration efficiency and modular design of ultrafiltration membranes for special types of wastewater to improve effluent quality and operational stability.]",
    "prod3_title": "[Membrane Bioreactor (MBR)]",
    "prod3_subtitle": "[Applications of Lined and Unlined 100% PVDF]",
    "prod3_p": "[Integrated research on MBR operating parameters and membrane fouling control strategies in municipal and industrial wastewater treatment, requiring coordination with different membrane filament products, operation, and maintenance.]",
    "prod4_title": "[High-Concentration Solid-Liquid Separation Filter]",
    "prod4_subtitle": "[Designed for high-concentration wastewater (can contain oil) using proprietary technology.]",
    "prod4_p": "[Filtration using original equipment can achieve the effect of RO ultrafiltration (UF) directly without pre-treatment.]",
    "prod5_title": "[Application-Specific Membrane Filament Selection]",
    "prod5_subtitle": "[Utilizing advanced materials and manufacturing processes to create different membrane filaments for various fields.]",
    "prod5_p": "[Features 100% PVDF membranes, multi-material composite membranes, and selection of different pore size filter materials based on water quality.]",
    "prod6_title": "[High-Performance Glass Media]",
    "prod6_subtitle": "[Colorless, transparent, high purity, no free silica, no sharp edges.]",
    "prod6_p": "[Can completely replace traditional filter media such as quartz sand and activated carbon. Laboratory certified and NSF certified.]",
    "tech_title": "[Technical Information]",
    "tech1_title": "[Hydrophilicity]",
    "tech1_p": "[Determines the degree of adsorption of organic pollutants in water to the membrane material, thereby affecting the membrane flux. A membrane material with good hydrophilicity does not easily adsorb organic pollutants, maintaining a higher membrane flux and improving filtration efficiency.]",
    "tech2_title": "[Membrane Pore Size]",
    "tech2_p": "[Pore size is one of its core features, directly determining the separation performance and application areas of the membrane. It usually refers to the opening size of physical pores or channels on the membrane surface or within the membrane. Ultrafiltration membrane pore size is typically characterized by size (micrometers) or molecular weight cut-off (Daltons).]",
    "tech3_title": "[Dead-End Filtration]",
    "tech3_p": "[All feed liquid passes through the ultrafiltration membrane under pressure to form permeate, with no continuous concentrate discharge. Suitable for raw water of good quality and low pollutant content, with simple operation and low energy consumption.]",
    "tech4_title": "[Cross-Flow Filtration]",
    "tech4_p": "[Part of the feed liquid passes through the ultrafiltration membrane under pressure, while another part flows along the membrane surface, carrying away retained impurities out of the membrane module, effectively reducing membrane fouling and improving filtration efficiency.]",
    "tech5_title": "[Forward Flush]",
    "tech5_p": "[Utilizes high-velocity water flow tangentially across the membrane surface to wash away loose, incompletely formed pollutant layers or suspended solids, preventing their compaction and accumulation.]",
    "tech6_title": "[Backwash]",
    "tech6_p": "[Applies water flow in the opposite direction of filtration, using the reverse pressure of the water flow to detach and wash away pollutants adhering to the membrane surface.]",
    "tech7_title": "[Chemically Enhanced Backwash (CEB)]",
    "tech7_p": "[Adds chemical agents to the backwash water. The dissolving and decomposing action of chemicals helps remove organic pollutants, microorganisms, and colloids that are difficult to effectively remove with simple physical backwashing. It is a maintenance chemical cleaning that falls between pure physical backwashing and a full chemical cleaning.]",
    "tech8_title": "[Chemical Cleaning (CIP)]",
    "tech8_p": "[An in-depth, thorough restorative chemical cleaning performed when the transmembrane pressure (ΔP) of the UF system rises significantly or the permeate production rate drops noticeably, and performance cannot be effectively restored through regular forward flush, backwash, or CEB. It is usually performed offline or with the system isolated from production, using higher concentrations of chemical agents circulated within the membrane system.]",
    "tech9_title": "[High-Performance Glass Filter Media]",
    "tech9_p": "[The product is derived from first-generation recyclable flat glass, designed by a Spanish R&D team for water treatment and filtration applications. Different particle sizes can be selected to achieve different filtration effects.]",
    "contact_title": "[JHB-Envirotech]",
    "contact_address": "[13F, No. 65, Section 1, Qingfeng Road, Zhongli District, Taoyuan City]",
    "contact_phone_title": "[Phone]",
    "contact_email_title": "[Email]",
    "footer_copyright": "[&copy; 2025 JHB-Envirotech Co., Ltd. All rights reserved.]"
}
